Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM6408PL10064.svd
            <register>
               <name>WAVE_DUALSLOPE_MODE</name>
               <description>Waveform</description>
               <alternateRegister>WAVE</alternateRegister>
               <addressOffset>0x3C</addressOffset>
               <fields>
                  <field>
                     <name>POL0</name>
                     <description>Channel 0 Polarity</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>POL0Select</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Compare output is set to ~DIR when TCC counter matches CCn value</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVERTED</name>
                           <description>Compare output is set to DIR when TCC counter matches CCn value.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POL1</name>
                     <description>Channel 1 Polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>POL1Select</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Compare output is set to ~DIR when TCC counter matches CCn value</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVERTED</name>
                           <description>Compare output is set to DIR when TCC counter matches CCn value.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POL2</name>
                     <description>Channel 2 Polarity</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>POL2Select</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Compare output is set to ~DIR when TCC counter matches CCn value</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVERTED</name>
                           <description>Compare output is set to DIR when TCC counter matches CCn value.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POL3</name>
                     <description>Channel 3 Polarity</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>POL3Select</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Compare output is set to ~DIR when TCC counter matches CCn value</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVERTED</name>
                           <description>Compare output is set to DIR when TCC counter matches CCn value.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WAVE_SINGLESLOPE_MODE</name>
               <description>Waveform</description>
               <alternateRegister>WAVE</alternateRegister>
               <addressOffset>0x3C</addressOffset>
               <fields>
                  <field>
                     <name>POL0</name>
                     <description>Channel 0 Polarity</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>POL0Select</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Compare output is initialized to ~DIR and set to DIR when TCC counter matches CCn value.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVERTED</name>
                           <description>Compare output is initialized to DIR and set to ~DIR when TCC counter matches CCn value.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POL1</name>
                     <description>Channel 1 Polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>POL1Select</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Compare output is initialized to ~DIR and set to DIR when TCC counter matches CCn value.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVERTED</name>
                           <description>Compare output is initialized to DIR and set to ~DIR when TCC counter matches CCn value.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POL2</name>
                     <description>Channel 2 Polarity</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>POL2Select</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Compare output is initialized to ~DIR and set to DIR when TCC counter matches CCn value.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVERTED</name>
                           <description>Compare output is initialized to DIR and set to ~DIR when TCC counter matches CCn value.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POL3</name>
                     <description>Channel 3 Polarity</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>POL3Select</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Compare output is initialized to ~DIR and set to DIR when TCC counter matches CCn value.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVERTED</name>
                           <description>Compare output is initialized to DIR and set to ~DIR when TCC counter matches CCn value.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PER</name>
               <description>Period</description>
               <addressOffset>0x40</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>PER</name>
                     <description>Period Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CC[%s]</name>
               <description>Compare/Capture Channel #</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>CC</name>
                     <description>Compare/Capture Channel Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PATTBUF</name>
               <description>Pattern Buffer</description>
               <addressOffset>0x64</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>PGEB0</name>
                     <description>Pattern Generation Output Enable Buffer 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGEB1</name>
                     <description>Pattern Generation Output Enable Buffer 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGEB2</name>
                     <description>Pattern Generation Output Enable Buffer 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGEB3</name>
                     <description>Pattern Generation Output Enable Buffer 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGVB0</name>
                     <description>Pattern Generation Output Value Buffer 0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGVB1</name>
                     <description>Pattern Generation Output Value Buffer 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGVB2</name>
                     <description>Pattern Generation Output Value Buffer 2</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGVB3</name>
                     <description>Pattern Generation Output Value Buffer 3</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PERBUF</name>
               <description>Period Buffer</description>
               <addressOffset>0x6C</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>PERBUF</name>
                     <description>Period Buffer Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF[%s]</name>
               <description>Compare/Capture Channel # Buffer</description>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>CCBUF</name>
                     <description>Compare/Capture Channel Buffer Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
